# 自建模組
from utils import list_jobs, connect_db

# 資料庫
client = connect_db()
db = client["104"]
collection = db["jobs"]

# 地區
areas = {
    "6001001001": "中正",
    "6001001002": "大同",
    "6001001003": "中山",
    "6001001004": "松山",
    "6001001005": "大安",
    "6001001006": "萬華",
    "6001001007": "信義",
    "6001001011": "南港",
    "6001002003": "板橋",
    "6001002014": "永和",
    "6001002015": "中和",
    "6001002016": "土城",
    "6001002017": "三峽",
    "6001002018": "鶯歌",
    "6001002019": "樹林",
    "6001002020": "三重",
    "6001002021": "新莊",
    "6001002022": "泰山",
    "6001002024": "蘆洲",
    "6001002025": "五股",
    "6001005000": "桃園",
    "6001006002": "新竹竹北",
    "6001006003": "新竹湖口",
    "6001006004": "新竹新豐",
    "6001006005": "新竹新埔",
    "6001006006": "新竹關西",
    "6001006007": "新竹芎林",
    "6001006008": "新竹寶山",
    "6001006009": "新竹竹東",
    "6001006010": "新竹五峰",
    "6001006011": "新竹橫山",
    "6001006012": "新竹尖石",
    "6001006013": "新竹北埔",
    "6001006014": "新竹峨眉",
}

# 取得 jobs list
all_jobs = list_jobs(areas)
collection.delete_many({})
collection.insert_many(all_jobs)
print(f"成功新增 {len(all_jobs)} 筆職缺資料")